Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "checkov -f tf.json --external-checks-git https://github.com/amazondevops/customs_policies.git --check \"JG_TF_01\" --compact --quiet" in "/home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default": exit status 1: running "checkov -f tf.json --external-checks-git https://github.com/amazondevops/customs_policies.git --check \"JG_TF_01\" --compact --quiet" in "/home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default": 
2024-04-30 10:00:03,838 [MainThread  ] [WARNI]  Custom policy /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default/57a154fa_checks/result/config.yaml is missing required fields metadata.id, metadata.name, metadata.category, definition
2024-04-30 10:00:03,842 [MainThread  ] [WARNI]  Custom policy /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default/57a154fa_checks/result/config.yaml is missing required fields metadata.id, metadata.name, metadata.category, definition
2024-04-30 10:00:03,850 [MainThread  ] [WARNI]  Custom policy /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default/57a154fa_checks/result/config.yaml is missing required fields metadata.id, metadata.name, metadata.category, definition
2024-04-30 10:00:04,021 [MainThread  ] [WARNI]  Custom policy /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default/57a154fa_checks/result/config.yaml is missing required fields metadata.id, metadata.name, metadata.category, definition
terraform_plan scan results:

Passed checks: 1, Failed checks: 1, Skipped checks: 0

Check: JG_TF_01: "Tag 'product_v2' not found for the S3 bucket"
	FAILED for resource: aws_s3_bucket.test
	File: /tf.json:0-0
	Guide: Follow the link to get more info https://docs.prismacloud.io/en/enterprise-edition/policy-reference


>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Checkov Code analysis Running for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default

2024-04-30 09:59:30,092 [MainThread  ] [WARNI]  Custom policy /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default/ca7d8533_checks/result/config.yaml is missing required fields metadata.id, metadata.name, metadata.category, definition
terraform scan results:

Passed checks: 1, Failed checks: 1, Skipped checks: 0

Check: JG_TF_01: "Tag 'product_v2' not found for the S3 bucket"
	FAILED for resource: aws_s3_bucket.test
	File: /main.tf:19-31
	Guide: Follow the link to get more info https://docs.prismacloud.io/en/enterprise-edition/policy-reference


>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Checkov Code analysis Done for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default

>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Running plan for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
  + resource "aws_s3_bucket" "my_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "checkov-1-test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-1-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-1-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.test will be created
  + resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-testint-tesr"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "Test"
          + "Scope"             = "PCI"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "Test"
          + "Scope"             = "PCI"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_security_group.example will be created
  + resource "aws_security_group" "example" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic on ports 22, 80, and 3389 from anywhere"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "example-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "Test"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all               = {
          + "Name"              = "Test"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.examplesg will be created
  + resource "aws_security_group" "examplesg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic on ports 22, 80, and 3389 from anywhere"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "123.34.54.24/32",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "example-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "Test"
          + "product_v2" = "dev"
        }
      + tags_all               = {
          + "Name"       = "Test"
          + "product_v2" = "dev"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default/default.tfplan"

>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Runned plan for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default

>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Checkov analysis is running for tf.plan for the project  in the directory /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/1/default

```
</details>